{
  "1": [
    "What’s the first thing you notice about someone when you meet them?",
    "Do you think first impressions are always accurate?",
    "How important is someone’s smile to you when you’re getting to know them?",
    "How do you feel when someone makes eye contact with you?",
    "Do you judge people based on their style or clothing?",
    "How do you think someone’s body language affects how you perceive them?",
    "Do you find it easier to trust someone who is confident or someone who is humble?",
    "Can you tell if someone is lying just by looking at them? If so, how?",
    "What do you think someone’s tone of voice says about them?",
    "Does someone’s level of politeness affect how you perceive them?",
    "How much does someone’s social media presence influence your opinion of them?",
    "What role does humor play in how you perceive someone?",
    "If someone is quiet, do you assume they are shy or mysterious?",
    "How do you feel when someone has a really strong opinion on something?",
    "Do you think the way a person treats waitstaff or service people speaks volumes about their character?",
    "How much do you rely on your gut feeling when meeting someone new?",
    "Can someone be -too friendly- in your opinion?",
    "If someone is always on their phone, how does that change your perception of them?",
    "Do you feel more drawn to people who are emotionally expressive or more reserved?",
    "What’s one thing that immediately makes you distrust someone?",
    "Do you think the way someone speaks reveals a lot about their personality?",
    "How much does someone’s background (culture, upbringing, etc.) influence how you perceive them?",
    "Do you care more about how someone acts or how they look?",
    "How important is it to you that someone remembers small details about you?",
    "When meeting someone for the first time, do you feel like you can tell if they’re being genuine?",
    "What’s your opinion on people who are always the life of the party?",
    "Do you think someone’s choice of friends says anything about them?",
    "How do you perceive someone who is always calm and collected in stressful situations?",
    "What’s your perception of someone who talks a lot about their achievements?",
    "Do you think someone’s ability to handle criticism says a lot about their personality?",
    "Do you tend to judge people based on their social status or career?",
    "How do you feel about people who give off “good vibes” right away?",
    "Do you find yourself gravitating toward people who are more talkative or more introverted?",
    "Do you think someone’s hobbies or interests impact how you see them?",
    "If someone has an unusual or quirky style, do you find it intriguing or off-putting?",
    "What do you think about people who are always trying to make a good impression?",
    "How do you feel about people who are always in a rush or seem stressed?",
    "Do you tend to admire people who are assertive or people who are more passive?",
    "Do you find it harder to trust someone who is constantly seeking validation from others?"
  ],
  "2": [
    "Who in your life truly understands you?",
    "How do you usually form deep friendships?",
    "What’s a quality you seek in close friends?",
    "Have you ever felt instantly connected to someone?",
    "Do you believe in soulmates or kindred spirits?",
    "How do you rebuild a broken connection?",
    "What's the most meaningful conversation you've had?",
    "How do you show people you care?",
    "Who do you call when you’re hurting?",
    "Have you ever lost touch with someone you wish you hadn't?",
    "When do you feel most like yourself?",
    "What habits keep you grounded and present?",
    "How do you recharge emotionally?",
    "What parts of yourself are hardest to understand?",
    "Do you listen to your intuition?",
    "How do you process your emotions?",
    "What helps you feel at peace?",
    "What does “being real” mean to you?",
    "When was the last time you surprised yourself?",
    "What’s one thing you’ve learned about yourself recently?",
    "What places feel like home to you?",
    "How do you connect with nature?",
    "What’s a culture you feel drawn to?",
    "Do you feel more connected in cities or solitude?",
    "What global issue deeply matters to you?",
    "Where in the world do you long to return?",
    "How do you stay informed and engaged?",
    "When have you felt a sense of belonging?",
    "What causes have moved you to action?",
    "What tradition or ritual brings you comfort?",
    "How has your view of connection changed?",
    "Who shaped your understanding of love?",
    "What childhood bond still lingers in memory?",
    "What do you want future connections to feel like?",
    "Is there someone you wish you could meet again?",
    "Have you ever reconnected after years apart?",
    "What memory always makes you feel seen?",
    "What legacy of connection do you hope to leave?",
    "How do you stay connected with your past?",
    "What does lasting connection look like to you?"
  ],
  "3": [
    "What do I need to hear right now?",
    "What lesson took you the longest to unlearn?",
    "What is a recent vulnerability you’ve shown and how did it feel?",
    "What do you think our relationship teaches others?"
  ]
}
